000100 IDENTIFICATION DIVISION.
000100 PROGRAM-ID. HELLO.
000100 
000100 ENVIRONMENT DIVISION.
000100    INPUT-OUTPUT SECTION.
000100    FILE-CONTROL.
000100    SELECT STUDENT ASSIGN TO 'output.txt'
000100       ORGANIZATION IS INDEXED
000100       ACCESS IS RANDOM
000100       RECORD KEY IS STUDENT-ID.
000100*       FILE STATUS IS FS.
000100 
000100 DATA DIVISION.
000100    FILE SECTION.
000100    FD STUDENT.
000100       01 STUDENT-FILE.
000100       05 STUDENT-ID PIC 9(5).
000100       05 NAME PIC A(25).
000100      
000100    WORKING-STORAGE SECTION.
000100    01 WS-STUDENT.
000100       05 WS-STUDENT-ID PIC 9(5).
000100       05 WS-NAME PIC A(25).
000100 
000100 PROCEDURE DIVISION.
000100    OPEN INPUT STUDENT.
000100       MOVE 20005 TO STUDENT-ID.
000100       
000100       READ STUDENT RECORD INTO WS-STUDENT
000100          KEY IS STUDENT-ID
000100          INVALID KEY DISPLAY 'Invalid Key'
000100          NOT INVALID KEY DISPLAY WS-STUDENT
000100       END-READ.
000100       
000100    CLOSE STUDENT.
000100 STOP RUN.