000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. YESNO01.
000300*--------------------------------------------------
000400* This program asks for a Y or N answer, and then
000500* displays whether the user chose yes or no.
000600*--------------------------------------------------
000700 ENVIRONMENT DIVISION.
000800 DATA DIVISION.
000900 WORKING-STORAGE SECTION.
001000
001100    01 NUM1 PIC 99.
001110    01 NUM2 PIC 99.
001120    01 NUM3 PIC 99.
001200
001300 PROCEDURE DIVISION.
001400 PROGRAM-BEGIN.
001500
001600 PERFORM INPUT-NUM.
001700
001800 PERFORM DISPLAY-THE-GREATEST.
001900
002000 PROGRAM-DONE.
002100 STOP RUN.
002200
002300 INPUT-NUM.
002400
002500 DISPLAY "Enter num1".
002510 ACCEPT NUM1.
002520 DISPLAY "Enter num2".
002530 ACCEPT NUM2.
002540 DISPLAY "Enter num3".
002600 ACCEPT NUM3.
002700
002800 DISPLAY-THE-GREATEST.
002900    IF (NUM1 > NUM2) AND (NUM1 > NUM3)  
003000       DISPLAY "Num1 Greater"
003100    ELSE IF (NUM2 > NUM1) AND (NUM2 > NUM3)  
003300          DISPLAY "Num2 Greater"
003400    ELSE
003500	     DISPLAY "Num3 Greater"
003600    END-IF.
003700
003800 DISPLAY-THE-SMALLEST.
003900    IF (NUM1 < NUM2) AND (NUM1 < NUM3)  
004000       DISPLAY "Num1 Smaller"
004100    ELSE IF (NUM2 < NUM1) AND (NUM2 < NUM3)  
004200          DISPLAY "Num2 Smaller"
004300    ELSE
004400	     DISPLAY "Num3 Smaller"
004500    END-IF.
